app/controllers/articles_controller.rb

INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`) VALUES ('new music', 'the best new song in Ghana is Defe Defe', '2024-07-03 11:07:52.959025', '2024-07-03 11:07:52.959025')
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `articles`.`body` = 'I am on Rails', `articles`.`updated_at` = '2024-07-03 11:52:36.407566' WHERE `articles`.`id` = 1
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)